# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, EDWRepNCSPELAN4, [256, 128, 64, 1]],  #  3

   # avg-conv down
   [-1, 1, ADown, [256]],  # 4-P3/8

   [-1, 1, SCSA, [256, 8]],  # 5  # 注意力添加在此处
   # elan-2 block
   [-1, 1, EDWRepNCSPELAN4, [512, 256, 128, 1]],  #   6

   # avg-conv down
   [-1, 1, ADown, [512]],  # 7-P4/16

   # elan-2 block
   [-1, 1, EDWRepNCSPELAN4, [512, 512, 256, 1]],  # 8

   # avg-conv down
   [-1, 1, ADown, [512]],  # 9-P5/32

   # elan-2 block
   [-1, 1, EDWRepNCSPELAN4, [512, 512, 256, 1]],  # 10
   [-1, 1, SCSA, [512, 8]],  # 11  # 注意力添加在此处
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  #  12

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #   15

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  #  (P3/8-small)  18

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #  (P4/16-medium)  21

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #  (P5/32-large)  24


   # multi-level reversible auxiliary branch

   # routing
   [6, 1, CBLinear, [[256]]], #   25
   [8, 1, CBLinear, [[256, 512]]], #   26
   [10, 1, CBLinear, [[256, 512, 512]]], #   27

   # conv down
   [0, 1, Conv, [64, 3, 2]],  # -P1/2  28

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # -P2/4  29

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  #   30

   # avg-conv down fuse
   [-1, 1, ADown, [256]],  # -P3/8  31
   [[25, 26, 27, -1], 1, CBFuse, [[0, 0, 0]]], #   32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  #   33

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # -P4/16  34
   [[26, 27, -1], 1, CBFuse, [[1, 1]]], #   35

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #   36

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # -P5/32  37
   [[27, -1], 1, CBFuse, [[2]]], #   38

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  #   39



   # detection head

   # detect
   [[33, 36, 39, 18, 21, 24], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
